notes/resources/nativescript/nativescript.org
#+TITLE: Nativescript
#+DATE: [2019-03-10 Sun 10:31]
#+AUTHOR: Damian Chrzanowski
#+EMAIL: pjdamian.chrzanowski@gmail.com
#+OPTIONS: TOC:2 num:2
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
#+HTML_HEAD: <link rel="icon" href="../../assets/favicon.ico">
[[file:../../index.org][Home Page]]
* Setup
  - Installing the Nativescript CLI
  #+begin_src shell
  npm i -g nativescript
  #+end_src
  - Verify installation
  #+begin_src shell
  tns
  #+end_src
  - Verify environment setup
  #+begin_src shell
  tns doctor
  #+end_src
  - Creating a project from a template
  #+begin_src shell
  tns create <APP NAME> --template <TEMPLATE NAME>
  #+end_src
  #+begin_verse
  [[https://market.nativescript.org/?tab=templates&category=all_templates][Templates List]]
  #+end_verse
* Running
  - Playground Integration
  #+begin_src shell
  tns preview
  #+end_src
  - Run Android or iOS
  #+begin_src shell
  tns run android
  tns run ios
  #+end_src
* Debugging
  - Use standard ~console.log()~ or ~console.dir()~ to output vars
  - Run in debug mode
  #+begin_src shell
  tns debug android
  tns debug ios
  #+end_src
* Samples
  - [[https://market.nativescript.org/?tab=samples&framework=all_frameworks&category=all_samples][Features and code samples]]
* Plugins
  - Find plugins in the [[http://market.nativescript.org/?_ga=2.20034875.2035096062.1552165814-1266045410.1549810337][marketplace]]
  - Install
  #+begin_src shell
  tns plugin add <PLUGIN NAME>
  tns plugin add nativescript-camera
  #+end_src
  - Use
  #+begin_src typescript
    import * as camera from "nativescript-camera"; // Requiring the plugin module
    camera.requestPermissions();

    // or import only a specific class/method/property of the plugin
    import { requestPermissions } from "nativescript-camera"; // Requiring only the needed code
    requestPermissions();
  #+end_src
  - Remove
  #+begin_src shell
  tns plugin remove nativescript-camera
  #+end_src
