notes/resources/nativescript/nativescript.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-10 Sun 20:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nativescript</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Damian Chrzanowski" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
<link rel="icon" href="../../assets/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">Nativescript</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd60f2fa">1. Setup</a></li>
<li><a href="#org345a2d3">2. Running</a></li>
<li><a href="#orga2fce59">3. Debugging</a></li>
<li><a href="#org333b84a">4. Samples</a></li>
<li><a href="#org364e03b">5. Plugins</a></li>
<li><a href="#orgfd22b0d">6. Important Module Imports</a></li>
<li><a href="#orgae3401b">7. Core Modules</a>
<ul>
<li><a href="#orgd8cfe96">7.1. Full List Of Core Modules</a></li>
<li><a href="#orgddbbb6e">7.2. Console</a></li>
<li><a href="#orgde7fe81">7.3. Application</a></li>
<li><a href="#org73ebca5">7.4. Application Settings</a></li>
<li><a href="#org938e562">7.5. Timer</a></li>
<li><a href="#org8f6e3e8">7.6. Connectivity</a></li>
</ul>
</li>
<li><a href="#orga9a6202">8. Device Functionality Modules</a>
<ul>
<li><a href="#org3842955">8.1. Platform</a></li>
<li><a href="#orgab817f0">8.2. File System</a></li>
<li><a href="#orgcc29690">8.3. Gestures</a></li>
</ul>
</li>
<li><a href="#org5eea481">9. User Interface Modules</a>
<ul>
<li><a href="#org864d006">9.1. Frame</a></li>
<li><a href="#org54fa1e4">9.2. Page</a></li>
<li><a href="#org74b5cfd">9.3. Color</a></li>
<li><a href="#org69f9243">9.4. XML Parsing</a></li>
</ul>
</li>
<li><a href="#org9f67350">10. Styling</a></li>
<li><a href="#org9cf471a">11. Themes</a></li>
<li><a href="#orge8cb941">12. Utils</a></li>
<li><a href="#org3cc1c65">13. Layouts</a>
<ul>
<li><a href="#org16dc667">13.1. Stack Layout</a></li>
<li><a href="#orgf8aff79">13.2. Grid Layout</a></li>
<li><a href="#org3796bfa">13.3. Absolute Layout</a></li>
<li><a href="#org949e0da">13.4. Wrap Layout</a></li>
<li><a href="#orgffca3d7">13.5. Dock Layout</a></li>
</ul>
</li>
<li><a href="#orgef20a6a">14. Widgets</a>
<ul>
<li><a href="#org85c95a0">14.1. ActionBar</a></li>
<li><a href="#orgb9b54f7">14.2. ActivityIndicator</a></li>
<li><a href="#orgbb1711e">14.3. Animations</a></li>
<li><a href="#org5142c4e">14.4. Button</a></li>
<li><a href="#org143d310">14.5. DatePicker</a></li>
<li><a href="#org8b4076c">14.6. Dialogs</a></li>
<li><a href="#org9b7b357">14.7. FormattedString</a></li>
<li><a href="#orgd620c17">14.8. Gestures</a></li>
<li><a href="#org2d248ff">14.9. HtmlView</a></li>
<li><a href="#orgf1c56f2">14.10. Image</a></li>
<li><a href="#org1090af2">14.11. Label</a></li>
<li><a href="#org50f7623">14.12. Layouts</a></li>
<li><a href="#orge014e03">14.13. ListPicker</a></li>
<li><a href="#org1626336">14.14. ListView</a></li>
<li><a href="#org1c8a30a">14.15. Progress</a></li>
<li><a href="#orgb60d806">14.16. ScrollView</a></li>
<li><a href="#org5b2df3b">14.17. SearchBar</a></li>
<li><a href="#orgb173cb9">14.18. SegmentedBar</a></li>
<li><a href="#org84ae98f">14.19. Slider</a></li>
<li><a href="#org90a1149">14.20. Styling</a></li>
<li><a href="#org606073e">14.21. Switch</a></li>
<li><a href="#orge872ade">14.22. TabView</a></li>
<li><a href="#org0f5bc7d">14.23. TextField</a></li>
<li><a href="#orgbe454c9">14.24. TextView</a></li>
<li><a href="#org32fbb66">14.25. TimePicker</a></li>
<li><a href="#orgad900f3">14.26. WebView</a></li>
<li><a href="#orgc0ec6eb">14.27. NG Directives</a></li>
<li><a href="#org41b1c71">14.28. Icon Fonts</a></li>
</ul>
</li>
<li><a href="#org8270ccb">15. Navigation</a>
<ul>
<li><a href="#org2f3f64b">15.1. Introduction</a></li>
<li><a href="#orgddfb345">15.2. Configuration</a></li>
<li><a href="#orgdb4bd23">15.3. <code>RouterExtensions</code></a></li>
</ul>
</li>
<li><a href="#org3ce1bb6">16. Multithreading with workers</a></li>
<li><a href="#org0705b28">17. Delete Heading once notes are completed, leave exports behind</a></li>
</ul>
</div>
</div>
<p>
<a href="../../index.html">Home Page</a>
</p>
<div id="outline-container-orgd60f2fa" class="outline-2">
<h2 id="orgd60f2fa"><span class="section-number-2">1</span> Setup</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Installing the Nativescript CLI</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">npm i -g nativescript
</pre>
</div>
<ul class="org-ul">
<li>Verify installation</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">tns
</pre>
</div>
<ul class="org-ul">
<li>Verify environment setup</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">tns doctor
</pre>
</div>
<ul class="org-ul">
<li>Creating a project from a template</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">tns create &lt;APP NAME&gt; --template &lt;TEMPLATE NAME&gt;
</pre>
</div>
<p class="verse">
<a href="https://market.nativescript.org/?tab=templates&amp;category=all_templates">Templates List</a><br />
</p>
</div>
</div>
<div id="outline-container-org345a2d3" class="outline-2">
<h2 id="org345a2d3"><span class="section-number-2">2</span> Running</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Playground Integration</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">tns preview
</pre>
</div>
<ul class="org-ul">
<li>Run Android or iOS</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">tns run android
tns run ios
</pre>
</div>
</div>
</div>
<div id="outline-container-orga2fce59" class="outline-2">
<h2 id="orga2fce59"><span class="section-number-2">3</span> Debugging</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Use standard <code>console.log()</code> or <code>console.dir()</code> to output vars</li>
<li>Run in debug mode</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">tns debug android
tns debug ios
</pre>
</div>
</div>
</div>
<div id="outline-container-org333b84a" class="outline-2">
<h2 id="org333b84a"><span class="section-number-2">4</span> Samples</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://market.nativescript.org/?tab=samples&amp;framework=all_frameworks&amp;category=all_samples">Features and code samples</a></li>
</ul>
</div>
</div>
<div id="outline-container-org364e03b" class="outline-2">
<h2 id="org364e03b"><span class="section-number-2">5</span> Plugins</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Find plugins in the <a href="http://market.nativescript.org/?_ga=2.20034875.2035096062.1552165814-1266045410.1549810337">marketplace</a></li>
<li>Install</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">tns plugin add &lt;PLUGIN NAME&gt;
tns plugin add nativescript-camera
</pre>
</div>
<ul class="org-ul">
<li>Use</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> * <span style="color: #51afef; font-style: italic;">as</span> camera <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"nativescript-camera"</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Requiring the plugin module</span>
camera.requestPermissions<span style="color: #fff0f5;">()</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">or import only a specific class/method/property of the plugin</span>
<span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> requestPermissions <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"nativescript-camera"</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Requiring only the needed code</span>
requestPermissions<span style="color: #fff0f5;">()</span>;
</pre>
</div>
<ul class="org-ul">
<li>Remove</li>
</ul>
<div class="org-src-container">
<pre class="src src-shell">tns plugin remove nativescript-camera
</pre>
</div>
</div>
</div>
