notes/resources/nativescript/nativescript.org
* Important Module Imports
  - ~NativeScriptFormsModule~: Two-way data binding (wrapper around Angular Forms)
  #+begin_src typescript
    import {NativeScriptFormsModule} from "nativescript-angular/forms"
    @NgModule({
        imports: [
            NativeScriptFormsModule, // RIGHT HERE
        ],
    })
  #+end_src
  - ~NativeScriptHttpClientModule~: HTTP Client module (wrapper around Angular's HTTP Client)
  #+begin_src typescript
    import { NativeScriptHttpClientModule } from 'nativescript-angular/http-client';
    @NgModule({
        imports: [
            NativeScriptHttpClientModule, // RIGHT HERE
        ],
    })
  #+end_src
  - ~NativeScriptCommonModule~: The Common module that contains directives and widgets. Only needed in sub-modules.
  #+begin_src typescript
    import { NativeScriptCommonModule } from "nativescript-angular/common";
    @NgModule({
        imports: [
            NativeScriptHttpClientModule, // RIGHT HERE
        ],
    })
  #+end_src
  - ~NativeScriptRouterModule~: Routing module, used instead of the standard Angular routing module. Sample setup below:
  #+begin_src typescript
    import { NgModule } from "@angular/core";
    import { Routes } from "@angular/router";
    import { NativeScriptRouterModule } from "nativescript-angular/router";

    const routes: Routes = [
        { path: "", redirectTo: "/home", pathMatch: "full" },
        { path: "home", loadChildren: "~/app/home/home.module#HomeModule" },
        { path: "browse", loadChildren: "~/app/browse/browse.module#BrowseModule" }
    ];

    @NgModule({
        imports: [NativeScriptRouterModule.forRoot(routes)],
        exports: [NativeScriptRouterModule]
    })
    export class AppRoutingModule { }
  #+end_src
  - ~NativeScriptAnimationsModule~: Animations module. Only add to *AppModule*. Use only if you need Angular Animations.
* Core Modules
** [[https://docs.nativescript.org/angular/core-concepts/modules#core-modules][Full List Of Core Modules]]
** [[https://docs.nativescript.org/ns-framework-modules/console][Console]]
   - Standard console output
   #+begin_src typescript
     console.log("NativeScript Playground!");
     console.log({ objProp: "I am Object!" });
     console.info("NativeScript Rocks!");
     console.warn("Low memory");
     console.error("Uncaught Application Exception");
     console.dir(jsonObj);
   #+end_src
   - Timing execution
   #+begin_src typescript
     // Begins counting a time span for a given name (key).
     console.time("LoadTime");
     // Ends a previously started time span through the time method.
     console.timeEnd("LoadTime");
   #+end_src
