notes/resources/nativescript/nativescript.html
<div id="outline-container-orgfd22b0d" class="outline-2">
<h2 id="orgfd22b0d"><span class="section-number-2">6</span> Important Module Imports</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><code>NativeScriptFormsModule</code>: Two-way data binding (wrapper around Angular Forms)</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span>NativeScriptFormsModule<span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"nativescript-angular/forms"</span>
@NgModule<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">{</span>
    imports: <span style="color: #98be65;">[</span>
        NativeScriptFormsModule, <span style="color: #5B6268;">// </span><span style="color: #5B6268;">RIGHT HERE</span>
    <span style="color: #98be65;">]</span>,
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>
</pre>
</div>
<ul class="org-ul">
<li><code>NativeScriptHttpClientModule</code>: HTTP Client module (wrapper around Angular's HTTP Client)</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> NativeScriptHttpClientModule <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">'nativescript-angular/http-client'</span>;
@NgModule<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">{</span>
    imports: <span style="color: #98be65;">[</span>
        NativeScriptHttpClientModule, <span style="color: #5B6268;">// </span><span style="color: #5B6268;">RIGHT HERE</span>
    <span style="color: #98be65;">]</span>,
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>
</pre>
</div>
<ul class="org-ul">
<li><code>NativeScriptCommonModule</code>: The Common module that contains directives and widgets. Only needed in sub-modules.</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> NativeScriptCommonModule <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"nativescript-angular/common"</span>;
@NgModule<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">{</span>
    imports: <span style="color: #98be65;">[</span>
        NativeScriptHttpClientModule, <span style="color: #5B6268;">// </span><span style="color: #5B6268;">RIGHT HERE</span>
    <span style="color: #98be65;">]</span>,
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>
</pre>
</div>
<ul class="org-ul">
<li><code>NativeScriptRouterModule</code>: Routing module, used instead of the standard Angular routing module. Sample setup below:</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> NgModule <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"@angular/core"</span>;
<span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> Routes <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"@angular/router"</span>;
<span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> NativeScriptRouterModule <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"nativescript-angular/router"</span>;

<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">routes</span>: Routes = <span style="color: #fff0f5;">[</span>
    <span style="color: #c678dd;">{</span> path: <span style="color: #98be65;">""</span>, redirectTo: <span style="color: #98be65;">"/home"</span>, pathMatch: <span style="color: #98be65;">"full"</span> <span style="color: #c678dd;">}</span>,
    <span style="color: #c678dd;">{</span> path: <span style="color: #98be65;">"home"</span>, loadChildren: <span style="color: #98be65;">"~/app/home/home.module#HomeModule"</span> <span style="color: #c678dd;">}</span>,
    <span style="color: #c678dd;">{</span> path: <span style="color: #98be65;">"browse"</span>, loadChildren: <span style="color: #98be65;">"~/app/browse/browse.module#BrowseModule"</span> <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">]</span>;

@NgModule<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">{</span>
    imports: <span style="color: #98be65;">[</span>NativeScriptRouterModule.forRoot<span style="color: #00bfff;">(</span>routes<span style="color: #00bfff;">)</span><span style="color: #98be65;">]</span>,
    exports: <span style="color: #98be65;">[</span>NativeScriptRouterModule<span style="color: #98be65;">]</span>
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">class</span> <span style="color: #ECBE7B;">AppRoutingModule</span> <span style="color: #fff0f5;">{</span> <span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li><code>NativeScriptAnimationsModule</code>: Animations module. Only add to <b>AppModule</b>. Use only if you need Angular Animations.</li>
</ul>
</div>
</div>
<div id="outline-container-orgae3401b" class="outline-2">
<h2 id="orgae3401b"><span class="section-number-2">7</span> Core Modules</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd8cfe96" class="outline-3">
<h3 id="orgd8cfe96"><span class="section-number-3">7.1</span> <a href="https://docs.nativescript.org/angular/core-concepts/modules#core-modules">Full List Of Core Modules</a></h3>
</div>
<div id="outline-container-orgddbbb6e" class="outline-3">
<h3 id="orgddbbb6e"><span class="section-number-3">7.2</span> <a href="https://docs.nativescript.org/ns-framework-modules/console">Console</a></h3>
<div class="outline-text-3" id="text-7-2">
<ul class="org-ul">
<li>Standard console output</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript">console.log<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"NativeScript Playground!"</span><span style="color: #fff0f5;">)</span>;
console.log<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">{</span> objProp: <span style="color: #98be65;">"I am Object!"</span> <span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;
console.info<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"NativeScript Rocks!"</span><span style="color: #fff0f5;">)</span>;
console.warn<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Low memory"</span><span style="color: #fff0f5;">)</span>;
console.error<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"Uncaught Application Exception"</span><span style="color: #fff0f5;">)</span>;
console.dir<span style="color: #fff0f5;">(</span>jsonObj<span style="color: #fff0f5;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>Timing execution</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">Begins counting a time span for a given name (key).</span>
console.time<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"LoadTime"</span><span style="color: #fff0f5;">)</span>;
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Ends a previously started time span through the time method.</span>
console.timeEnd<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"LoadTime"</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>
