notes/resources/nativescript/nativescript.org
** [[https://docs.nativescript.org/ns-framework-modules/application][Application]]
   - Platform check
   #+begin_src typescript
     if (application.android) {
         console.log("We are running on Android device!");
     } else if (application.ios) {
         console.log("We are running on iOS device");
     }
   #+end_src
   - Android
     - Accessing the Application Module
     #+begin_src typescript
       import { android as androidApp } from "tns-core-modules/application";

       let isPaused = androidApp.paused; // e.g. false
       let packageName = androidApp.packageName; // The package ID e.g. org.nativescript.nativescriptsdkexamplesng
       let nativeApp = androidApp.nativeApp; // The native APplication reference
       let foregroundActivity = androidApp.foregroundActivity; // The current Activity reference
       let currentContext = androidApp.currentContext; // The current Android context
       let context = androidApp.context; console.log(context); // The current Android context
     #+end_src
     - Registering events
     #+begin_src typescript
       launchListener = applicationModule.on(applicationModule.launchEvent, (args) => {
           // The root view for this Window on iOS or Activity for Android.
           // If not set a new Frame will be created as a root view in order to maintain backwards compatibility.
           console.log("Root View: ", args.root);
           console.log("The appication was launched!");
           vm.set("resumeEvent", "The appication was launched!");
       });
     #+end_src
     - Removing registered events
     #+begin_src typescript
       applicationModule.off(applicationModule.launchEvent, launchListener);
     #+end_src
   - iOS
   #+begin_src typescript
     import { ios as iosApp } from "tns-core-modules/application";

     // https://developer.apple.com/documentation/uikit/uiapplicationdelegate?language=objc
     let delegate = iosApp.delegate; // the iOS application delegate

     let nativeApp = iosApp.nativeApp; // The native iOS app

     // https://developer.apple.com/documentation/uikit/uiwindow/1621581-rootviewcontroller?language=objc
     let rootController = iosApp.rootController; // the iOS rootViewController

     let window = iosApp.window; // UIWindow
   #+end_src
** [[https://docs.nativescript.org/ns-framework-modules/application-settings][Application Settings]]
   - Usage
   #+begin_src typescript
     import * as appSettings from "tns-core-modules/application-settings";

     // booleans
     const items = [];
     appSettings.setBoolean("isTurnedOn", true);
     // false is default if 'isTurnedOn' is not set
     const isTurnedOn = appSettings.getBoolean("isTurnedOn", false);

     // strings
     appSettings.setString("username", "NickIliev");
     const username = appSettings.getString("username");

     // numbers
     appSettings.setNumber("locationX", 54.321);
     const locationX = parseFloat(appSettings.getNumber("locationX").toFixed(3));

     // key check
     // will return false if there is no "noBoolKey"
     const noBoolKey = appSettings.hasKey("noBoolKey");

     // will remove the setting for a key
     appSettings.remove("keyToRemove");

     // Removes all values.
     appSettings.clear();
   #+end_src
** [[https://docs.nativescript.org/ns-framework-modules/timer][Timer]]
   - Usage
   #+begin_src typescript
     import { setInterval, setTimeout, clearInterval } from "tns-core-modules/timer";

     // Usage is the same as standard JS
   #+end_src
