notes/resources/nativescript/nativescript.html
<div id="outline-container-orgde7fe81" class="outline-3">
<h3 id="orgde7fe81"><span class="section-number-3">7.3</span> <a href="https://docs.nativescript.org/ns-framework-modules/application">Application</a></h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>Platform check</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">(</span>application.android<span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">"We are running on Android device!"</span><span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">else</span> <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">(</span>application.ios<span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">"We are running on iOS device"</span><span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li><p>
Android
</p>
<ul class="org-ul">
<li>Accessing the Application Module</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> android <span style="color: #51afef; font-style: italic;">as</span> androidApp <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/application"</span>;

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">isPaused</span> = androidApp.paused; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">e.g. false</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">packageName</span> = androidApp.packageName; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">The package ID e.g. org.nativescript.nativescriptsdkexamplesng</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">nativeApp</span> = androidApp.nativeApp; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">The native APplication reference</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">foregroundActivity</span> = androidApp.foregroundActivity; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">The current Activity reference</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">currentContext</span> = androidApp.currentContext; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">The current Android context</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">context</span> = androidApp.context; console.log<span style="color: #fff0f5;">(</span>context<span style="color: #fff0f5;">)</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">The current Android context</span>
</pre>
</div>
<ul class="org-ul">
<li>Registering events</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript">launchListener = applicationModule.on<span style="color: #fff0f5;">(</span>applicationModule.launchEvent, <span style="color: #c678dd;">(</span>args<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">The root view for this Window on iOS or Activity for Android.</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">If not set a new Frame will be created as a root view in order to maintain backwards compatibility.</span>
    console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">"Root View: "</span>, args.root<span style="color: #98be65;">)</span>;
    console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">"The appication was launched!"</span><span style="color: #98be65;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"resumeEvent"</span>, <span style="color: #98be65;">"The appication was launched!"</span><span style="color: #98be65;">)</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>Removing registered events</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript">applicationModule.off<span style="color: #fff0f5;">(</span>applicationModule.launchEvent, launchListener<span style="color: #fff0f5;">)</span>;
</pre>
</div></li>
<li>iOS</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> ios <span style="color: #51afef; font-style: italic;">as</span> iosApp <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/application"</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">https://developer.apple.com/documentation/uikit/uiapplicationdelegate?language=objc</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">delegate</span> = iosApp.delegate; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">the iOS application delegate</span>

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">nativeApp</span> = iosApp.nativeApp; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">The native iOS app</span>

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">https://developer.apple.com/documentation/uikit/uiwindow/1621581-rootviewcontroller?language=objc</span>
<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">rootController</span> = iosApp.rootController; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">the iOS rootViewController</span>

<span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">window</span> = iosApp.window; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">UIWindow</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org73ebca5" class="outline-3">
<h3 id="org73ebca5"><span class="section-number-3">7.4</span> <a href="https://docs.nativescript.org/ns-framework-modules/application-settings">Application Settings</a></h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>Usage</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> * <span style="color: #51afef; font-style: italic;">as</span> appSettings <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/application-settings"</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">booleans</span>
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">items</span> = <span style="color: #fff0f5;">[]</span>;
appSettings.setBoolean<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"isTurnedOn"</span>, <span style="color: #51afef; font-style: italic;">true</span><span style="color: #fff0f5;">)</span>;
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">false is default if 'isTurnedOn' is not set</span>
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">isTurnedOn</span> = appSettings.getBoolean<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"isTurnedOn"</span>, <span style="color: #51afef; font-style: italic;">false</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">strings</span>
appSettings.setString<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"username"</span>, <span style="color: #98be65;">"NickIliev"</span><span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">username</span> = appSettings.getString<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"username"</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">numbers</span>
appSettings.setNumber<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"locationX"</span>, 54.321<span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">locationX</span> = parseFloat<span style="color: #fff0f5;">(</span>appSettings.getNumber<span style="color: #c678dd;">(</span><span style="color: #98be65;">"locationX"</span><span style="color: #c678dd;">)</span>.toFixed<span style="color: #c678dd;">(</span>3<span style="color: #c678dd;">)</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">key check</span>
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">will return false if there is no "noBoolKey"</span>
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">noBoolKey</span> = appSettings.hasKey<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"noBoolKey"</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">will remove the setting for a key</span>
appSettings.remove<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"keyToRemove"</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Removes all values.</span>
appSettings.clear<span style="color: #fff0f5;">()</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-org938e562" class="outline-3">
<h3 id="org938e562"><span class="section-number-3">7.5</span> <a href="https://docs.nativescript.org/ns-framework-modules/timer">Timer</a></h3>
<div class="outline-text-3" id="text-7-5">
<ul class="org-ul">
<li>Usage</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> setInterval, setTimeout, clearInterval <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/timer"</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Usage is the same as standard JS</span>
</pre>
</div>
</div>
</div>
