notes/resources/nativescript/nativescript.org
** [[https://docs.nativescript.org/ns-framework-modules/connectivity][Connectivity]]
   - Usage
   #+begin_src typescript
     import { connectionType, getConnectionType, startMonitoring, stopMonitoring }from "tns-core-modules/connectivity";

     // result is ConnectionType enumeration (none, wifi or mobile)
     const myConnectionType = getConnectionType();

     switch (myConnectionType) {
         case connectionType.none:
             // Denotes no Internet connection.
             console.log("No connection");
             break;
         case connectionType.wifi:
             // Denotes a WiFi connection.
             console.log("WiFi connection");
             break;
         case connectionType.mobile:
             // Denotes a mobile connection, i.e. cellular network or WAN.
             console.log("Mobile connection");
             break;
         case connectionType.ethernet:
             // Denotes a ethernet connection.
             console.log("Ethernet connection");
             break;
         // Bluetooth functionality in master branch (to be released with 5.0.0)
         // case connectionType.bluetooth:
         //     // Denotes a ethernet connection.
         //     console.log("Bluetooth connection");
         //    //     break;
         default:
             break;
     }
   #+end_src
   - Monitoring
   #+begin_src typescript
     startMonitoring((newConnectionType) => {
         switch (newConnectionType) {
             case connectionType.none:
                 console.log("Connection type changed to none.");
                 break;
             case connectionType.wifi:
                 console.log("Connection type changed to WiFi.");
                 break;
             case connectionType.mobile:
                 console.log("Connection type changed to mobile.");
                 break;
             case connectionType.ethernet:
                 console.log("Connection type changed to ethernet.");
                 break;
             // case connectionType.bluetooth:
             //     // feature coming in NativeScript 5.0.0
             //     console.log("Connection type changed to bluetooth.");
             //     break;
             default:
                 break;
         }
     });

     // Explicitly stopping the monitoring
     stopMonitoring();
   #+end_src
   - NOTE: Android needs specific permission to access network information
   #+begin_src xml
     <uses-permission android:name="android.permission.ACCESS_NETWORK_STATE"/>
   #+end_src
* Device Functionality Modules
