notes/resources/nativescript/nativescript.html
<div id="outline-container-org8f6e3e8" class="outline-3">
<h3 id="org8f6e3e8"><span class="section-number-3">7.6</span> <a href="https://docs.nativescript.org/ns-framework-modules/connectivity">Connectivity</a></h3>
<div class="outline-text-3" id="text-7-6">
<ul class="org-ul">
<li>Usage</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> connectionType, getConnectionType, startMonitoring, stopMonitoring <span style="color: #fff0f5;">}</span><span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/connectivity"</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">result is ConnectionType enumeration (none, wifi or mobile)</span>
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">myConnectionType</span> = getConnectionType<span style="color: #fff0f5;">()</span>;

<span style="color: #51afef; font-style: italic;">switch</span> <span style="color: #fff0f5;">(</span>myConnectionType<span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">case</span> connectionType.none:
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Denotes no Internet connection.</span>
        console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">"No connection"</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef; font-style: italic;">break</span>;
    <span style="color: #51afef; font-style: italic;">case</span> connectionType.wifi:
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Denotes a WiFi connection.</span>
        console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">"WiFi connection"</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef; font-style: italic;">break</span>;
    <span style="color: #51afef; font-style: italic;">case</span> connectionType.mobile:
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Denotes a mobile connection, i.e. cellular network or WAN.</span>
        console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">"Mobile connection"</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef; font-style: italic;">break</span>;
    <span style="color: #51afef; font-style: italic;">case</span> connectionType.ethernet:
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Denotes a ethernet connection.</span>
        console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">"Ethernet connection"</span><span style="color: #c678dd;">)</span>;
        <span style="color: #51afef; font-style: italic;">break</span>;
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Bluetooth functionality in master branch (to be released with 5.0.0)</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">case connectionType.bluetooth:</span>
    <span style="color: #5B6268;">//     </span><span style="color: #5B6268;">// Denotes a ethernet connection.</span>
    <span style="color: #5B6268;">//     </span><span style="color: #5B6268;">console.log("Bluetooth connection");</span>
    <span style="color: #5B6268;">//    </span><span style="color: #5B6268;">//     break;</span>
    <span style="color: #51afef; font-style: italic;">default</span>:
        <span style="color: #51afef; font-style: italic;">break</span>;
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>Monitoring</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript">startMonitoring<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">(</span>newConnectionType<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
    <span style="color: #51afef; font-style: italic;">switch</span> <span style="color: #98be65;">(</span>newConnectionType<span style="color: #98be65;">)</span> <span style="color: #98be65;">{</span>
        <span style="color: #51afef; font-style: italic;">case</span> connectionType.none:
            console.log<span style="color: #00bfff;">(</span><span style="color: #98be65;">"Connection type changed to none."</span><span style="color: #00bfff;">)</span>;
            <span style="color: #51afef; font-style: italic;">break</span>;
        <span style="color: #51afef; font-style: italic;">case</span> connectionType.wifi:
            console.log<span style="color: #00bfff;">(</span><span style="color: #98be65;">"Connection type changed to WiFi."</span><span style="color: #00bfff;">)</span>;
            <span style="color: #51afef; font-style: italic;">break</span>;
        <span style="color: #51afef; font-style: italic;">case</span> connectionType.mobile:
            console.log<span style="color: #00bfff;">(</span><span style="color: #98be65;">"Connection type changed to mobile."</span><span style="color: #00bfff;">)</span>;
            <span style="color: #51afef; font-style: italic;">break</span>;
        <span style="color: #51afef; font-style: italic;">case</span> connectionType.ethernet:
            console.log<span style="color: #00bfff;">(</span><span style="color: #98be65;">"Connection type changed to ethernet."</span><span style="color: #00bfff;">)</span>;
            <span style="color: #51afef; font-style: italic;">break</span>;
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">case connectionType.bluetooth:</span>
        <span style="color: #5B6268;">//     </span><span style="color: #5B6268;">// feature coming in NativeScript 5.0.0</span>
        <span style="color: #5B6268;">//     </span><span style="color: #5B6268;">console.log("Connection type changed to bluetooth.");</span>
        <span style="color: #5B6268;">//     </span><span style="color: #5B6268;">break;</span>
        <span style="color: #51afef; font-style: italic;">default</span>:
            <span style="color: #51afef; font-style: italic;">break</span>;
    <span style="color: #98be65;">}</span>
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Explicitly stopping the monitoring</span>
stopMonitoring<span style="color: #fff0f5;">()</span>;
</pre>
</div>
<ul class="org-ul">
<li>NOTE: Android needs specific permission to access network information</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">uses-permission</span> <span style="color: #c678dd;">android</span>:<span style="color: #db5762;">name</span>=<span style="color: #98be65;">"android.permission.ACCESS_NETWORK_STATE"</span>/&gt;
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga9a6202" class="outline-2">
<h2 id="orga9a6202"><span class="section-number-2">8</span> Device Functionality Modules</h2>
<div class="outline-text-2" id="text-8">
</div>
