notes/resources/nativescript/nativescript.html
<div id="outline-container-org3842955" class="outline-3">
<h3 id="org3842955"><span class="section-number-3">8.1</span> <a href="https://docs.nativescript.org/ns-framework-modules/platform">Platform</a></h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>Get system info</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">onNavigatingTo</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">page</span> = &lt;Page&gt;args.<span style="color: #51afef; font-style: italic;">object</span>;
    <span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">vm</span> = <span style="color: #51afef; font-style: italic;">new</span> <span style="color: #ECBE7B;">Observable</span><span style="color: #c678dd;">()</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"deviceInformationmodel"</span>, device.model<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"deviceInformationdeviceType"</span>, device.deviceType<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"deviceInformationos"</span>, device.os<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"deviceInformationosVersion"</span>, device.osVersion<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"deviceInformationsdkVersion"</span>, device.sdkVersion<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"deviceInformationlanguage"</span>, device.language<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"deviceInformationmanufacturer"</span>, device.manufacturer<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"deviceInformationuuid"</span>, device.uuid<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"screenInformationheightDIPs"</span>, screen.mainScreen.heightDIPs<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"screenInformationheightPixels"</span>, screen.mainScreen.heightPixels<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"screenInformationscale"</span>, screen.mainScreen.scale<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"screenInformationwidthDIPs"</span>, screen.mainScreen.widthDIPs<span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"screenInformationwidthPixels"</span>, screen.mainScreen.widthPixels<span style="color: #c678dd;">)</span>;

    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"deviceInfoButton"</span>, <span style="color: #98be65;">"Show device info"</span><span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"screenInfoButton"</span>, <span style="color: #98be65;">"Show screen info"</span><span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"isItemVisible"</span>, <span style="color: #51afef; font-style: italic;">false</span><span style="color: #c678dd;">)</span>;
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"isItemVisibleScreenInfo"</span>, <span style="color: #51afef; font-style: italic;">false</span><span style="color: #c678dd;">)</span>;
    page.bindingContext = vm;
<span style="color: #fff0f5;">}</span>


<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">checkPlatformType</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">message</span> = <span style="color: #98be65;">""</span>;
    <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">(</span>isAndroid<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        message = <span style="color: #98be65;">"You are using Android device"</span>;
    <span style="color: #c678dd;">}</span> <span style="color: #51afef; font-style: italic;">else</span> <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">(</span>isIOS<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        message = <span style="color: #98be65;">"You are using IOS device"</span>;
    <span style="color: #c678dd;">}</span>
    dialogs.alert<span style="color: #c678dd;">(</span>message<span style="color: #c678dd;">)</span>
        .then<span style="color: #c678dd;">(</span><span style="color: #98be65;">()</span> =&gt; <span style="color: #98be65;">{</span>
            console.log<span style="color: #00bfff;">(</span><span style="color: #98be65;">"Dialog closed!"</span><span style="color: #00bfff;">)</span>;
        <span style="color: #98be65;">}</span><span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">deviceInfo</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">page</span>: Page = &lt;Page&gt;args.<span style="color: #51afef; font-style: italic;">object</span>.page;
    <span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">vm</span> = page.bindingContext;
    <span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">isItemVisible</span> = vm.<span style="color: #51afef; font-style: italic;">get</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"isItemVisible"</span><span style="color: #c678dd;">)</span>;
    <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">(</span>isItemVisible<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"deviceInfoButton"</span>, <span style="color: #98be65;">"Show device info"</span><span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span> <span style="color: #51afef; font-style: italic;">else</span> <span style="color: #c678dd;">{</span>
        vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"deviceInfoButton"</span>, <span style="color: #98be65;">"Hide device info"</span><span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span>
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"isItemVisible"</span>, !isItemVisible<span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>

<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">screenInfo</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">page</span>: Page = &lt;Page&gt;args.<span style="color: #51afef; font-style: italic;">object</span>.page;
    <span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">vm</span> = page.bindingContext;
    <span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">isItemVisibleScreenInfo</span> = vm.<span style="color: #51afef; font-style: italic;">get</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"isItemVisibleScreenInfo"</span><span style="color: #c678dd;">)</span>;
    <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">(</span>isItemVisibleScreenInfo<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
        vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"screenInfoButton"</span>, <span style="color: #98be65;">"Show screen info"</span><span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span> <span style="color: #51afef; font-style: italic;">else</span> <span style="color: #c678dd;">{</span>
        vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"screenInfoButton"</span>, <span style="color: #98be65;">"Hide screen info"</span><span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span>
    vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"isItemVisibleScreenInfo"</span>, !isItemVisibleScreenInfo<span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
