notes/resources/nativescript/nativescript.org
** [[https://docs.nativescript.org/ns-framework-modules/file-system][File System]]
   - Creation
   #+begin_src typescript
     import { knownFolders, Folder, File } from "tns-core-modules/file-system";

     const documents: Folder = <Folder>knownFolders.documents();
     const folder: Folder = <Folder>documents.getFolder(vm.get("folderName") || "testFolder");
     const file: File = <File>folder.getFile(`${(vm.get("fileName") || "testFile")}` + `.txt`);

     file.writeText(vm.get("fileTextContent") || "some random content")
         .then(() => {
             file.readText()
                 .then((res) => {
                     vm.set("successMessage", `Successfully saved in${file.path}`);
                     vm.set("writtenContent", res);
                     vm.set("isItemVisible", true);
                 });
         }).catch((err) => {
             console.log(err);
         });
   #+end_src
   - Deletion
   #+begin_src typescript
     file.remove()
         .then((res) => {
             // Success removing the file.
             vm.set("resultMessage", "File successfully deleted!");
         }).catch((err) => {
             console.log(err.stack);
         });
   #+end_src
   - Reading
   #+begin_src typescript
     file.readText()
         .then((res) => {
             vm.set("writtenContent", res);
         }).catch((err) => {
             console.log(err.stack);
         });
   #+end_src
