notes/resources/nativescript/nativescript.html
<div id="outline-container-orgab817f0" class="outline-3">
<h3 id="orgab817f0"><span class="section-number-3">8.2</span> <a href="https://docs.nativescript.org/ns-framework-modules/file-system">File System</a></h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li>Creation</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> knownFolders, Folder, File <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/file-system"</span>;

<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">documents</span>: Folder = &lt;Folder&gt;knownFolders.documents<span style="color: #fff0f5;">()</span>;
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">folder</span>: Folder = &lt;Folder&gt;documents.getFolder<span style="color: #fff0f5;">(</span>vm.<span style="color: #51afef; font-style: italic;">get</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"folderName"</span><span style="color: #c678dd;">)</span> || <span style="color: #98be65;">"testFolder"</span><span style="color: #fff0f5;">)</span>;
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">file</span>: File = &lt;File&gt;folder.getFile<span style="color: #fff0f5;">(</span><span style="color: #98be65;">`${(vm.get("fileName") || "testFile")}`</span> + <span style="color: #98be65;">`.txt`</span><span style="color: #fff0f5;">)</span>;

file.writeText<span style="color: #fff0f5;">(</span>vm.<span style="color: #51afef; font-style: italic;">get</span><span style="color: #c678dd;">(</span><span style="color: #98be65;">"fileTextContent"</span><span style="color: #c678dd;">)</span> || <span style="color: #98be65;">"some random content"</span><span style="color: #fff0f5;">)</span>
    .then<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">()</span> =&gt; <span style="color: #c678dd;">{</span>
        file.readText<span style="color: #98be65;">()</span>
            .then<span style="color: #98be65;">(</span><span style="color: #00bfff;">(</span>res<span style="color: #00bfff;">)</span> =&gt; <span style="color: #00bfff;">{</span>
                vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"successMessage"</span>, <span style="color: #98be65;">`Successfully saved in${file.path}`</span><span style="color: #a9a1e1;">)</span>;
                vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"writtenContent"</span>, res<span style="color: #a9a1e1;">)</span>;
                vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"isItemVisible"</span>, <span style="color: #51afef; font-style: italic;">true</span><span style="color: #a9a1e1;">)</span>;
            <span style="color: #00bfff;">}</span><span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>.<span style="color: #51afef; font-style: italic;">catch</span><span style="color: #fff0f5;">(</span><span style="color: #c678dd;">(</span>err<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
        console.log<span style="color: #98be65;">(</span>err<span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>Deletion</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript">file.remove<span style="color: #fff0f5;">()</span>
    .then<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">(</span>res<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
        <span style="color: #5B6268;">// </span><span style="color: #5B6268;">Success removing the file.</span>
        vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"resultMessage"</span>, <span style="color: #98be65;">"File successfully deleted!"</span><span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>.<span style="color: #51afef; font-style: italic;">catch</span><span style="color: #fff0f5;">(</span><span style="color: #c678dd;">(</span>err<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
        console.log<span style="color: #98be65;">(</span>err.stack<span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>Reading</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript">file.readText<span style="color: #fff0f5;">()</span>
    .then<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">(</span>res<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
        vm.<span style="color: #51afef; font-style: italic;">set</span><span style="color: #98be65;">(</span><span style="color: #98be65;">"writtenContent"</span>, res<span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>.<span style="color: #51afef; font-style: italic;">catch</span><span style="color: #fff0f5;">(</span><span style="color: #c678dd;">(</span>err<span style="color: #c678dd;">)</span> =&gt; <span style="color: #c678dd;">{</span>
        console.log<span style="color: #98be65;">(</span>err.stack<span style="color: #98be65;">)</span>;
    <span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>
