notes/resources/nativescript/nativescript.org
** [[https://docs.nativescript.org/ui/ns-ui-widgets/gestures][Gestures]]
   - Tap on view
   #+begin_src typescript
     myView.on("tap", () => {
         console.log("myView tapped!");
     })
   #+end_src
   - Tap on element
   #+begin_src xml
     <Label text="Tap Me" (tap)="onTap()"/>
   #+end_src
   #+begin_src typescript
     export function onTap(args) {
         console.log("Label tapped!");
     };
   #+end_src
   - Double Tap
   #+begin_src xml
     <Label text="Tap Me" (doubleTap)="onDoubleTap()"/>
   #+end_src
   #+begin_src typescript
     export function onDoubleTap(args) {
         console.log("Label tapped!");
     };
   #+end_src
   - Long press
   #+begin_src xml
   <Label text="Long Press me!" longPress="onLongPress()"/>
   #+end_src
   - Pan
   #+begin_src xml
   <Label text="Pan me!" pan="onPan()"/>
   #+end_src
   #+begin_src typescript
     import { PanGestureEventData } from "tns-core-modules/ui/gestures";

     export function onPan(args: PanGestureEventData) {
         // args is of type PanGestureEventData
         console.log(`${args.eventName} event triggered for ${args.view}`);
         console.log(`deltaX: ${args.deltaX}`);
         console.log(`deltaY: ${args.deltaY}`);
         console.log(`state: ${args.state}`);
     }
   #+end_src
   - Pinch
   #+begin_src xml
     <Label text="Pinch me!" pinch="onPinch()" />
   #+end_src
   #+begin_src typescript
     import { PinchGestureEventData } from "tns-core-modules/ui/gestures";

     export function onPinch(args: PinchGestureEventData) {
         // args is of type PinchGestureEventData
         console.log(`scale: ${args.scale}`);
         console.log(`tate: ${args.state}`);
         console.log(`getFocusX(): ${args.getFocusX()}`);
         console.log(`getFocusY(): ${args.getFocusY()}`);
     }
   #+end_src
   - Rotation
   #+begin_src xml
     <Label text="Rotate me!" rotation="onRotation()"/>
   #+end_src
   #+begin_src typescript
     import { RotationGestureEventData } from "tns-core-modules/ui/gestures";

     export function onRotation(args: RotationGestureEventData) {
         // args is of type RotationGestureEventData
         console.log(`${args.eventName} event triggered for ${args.view}`);
         console.log(`rotation:  ${args.rotation}`);
         console.log(`state:  ${args.state}`);
     }
   #+end_src
   - Swipe
   #+begin_src xml
     <Label text="Swipe me!" swipe="onSwipe()"/>
   #+end_src
   #+begin_src typescript
     import { SwipeDirection, SwipeGestureEventData } from "tns-core-modules/ui/gestures";

     export function onSwipe(args: SwipeGestureEventData) {
         alert(`${args.eventName} event triggered for ${args.view}`);
         let direction: SwipeDirection = args.direction;
         console.log(`direction ${direction}`); // SwipeDirection enumeration: up, down, left, right
     }
   #+end_src
* User Interface Modules
** [[https://docs.nativescript.org/ui/ns-ui-widgets/frame][Frame]]
   - Generally not needed when working with Angular
** [[https://docs.nativescript.org/ui/ns-ui-widgets/page][Page]]
   - Generally not needed when working with Angular, unless for binding the context
