notes/resources/nativescript/nativescript.html
<div id="outline-container-orgcc29690" class="outline-3">
<h3 id="orgcc29690"><span class="section-number-3">8.3</span> <a href="https://docs.nativescript.org/ui/ns-ui-widgets/gestures">Gestures</a></h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li>Tap on view</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript">myView.on<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"tap"</span>, <span style="color: #c678dd;">()</span> =&gt; <span style="color: #c678dd;">{</span>
    console.log<span style="color: #98be65;">(</span><span style="color: #98be65;">"myView tapped!"</span><span style="color: #98be65;">)</span>;
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>Tap on element</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">Label</span> <span style="color: #db5762;">text</span>=<span style="color: #98be65;">"Tap Me"</span> (tap)=<span style="color: #98be65;">"onTap()"</span>/&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">onTap</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">"Label tapped!"</span><span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>;
</pre>
</div>
<ul class="org-ul">
<li>Double Tap</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">Label</span> <span style="color: #db5762;">text</span>=<span style="color: #98be65;">"Tap Me"</span> (doubleTap)=<span style="color: #98be65;">"onDoubleTap()"</span>/&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">onDoubleTap</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">"Label tapped!"</span><span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>;
</pre>
</div>
<ul class="org-ul">
<li>Long press</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">Label</span> <span style="color: #db5762;">text</span>=<span style="color: #98be65;">"Long Press me!"</span> <span style="color: #db5762;">longPress</span>=<span style="color: #98be65;">"onLongPress()"</span>/&gt;
</pre>
</div>
<ul class="org-ul">
<li>Pan</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">Label</span> <span style="color: #db5762;">text</span>=<span style="color: #98be65;">"Pan me!"</span> <span style="color: #db5762;">pan</span>=<span style="color: #98be65;">"onPan()"</span>/&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> PanGestureEventData <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/ui/gestures"</span>;

<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">onPan</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span>: <span style="color: #db5762;">PanGestureEventData</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">args is of type PanGestureEventData</span>
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`${args.eventName} event triggered for ${args.view}`</span><span style="color: #c678dd;">)</span>;
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`deltaX: ${args.deltaX}`</span><span style="color: #c678dd;">)</span>;
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`deltaY: ${args.deltaY}`</span><span style="color: #c678dd;">)</span>;
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`state: ${args.state}`</span><span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>Pinch</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">Label</span> <span style="color: #db5762;">text</span>=<span style="color: #98be65;">"Pinch me!"</span> <span style="color: #db5762;">pinch</span>=<span style="color: #98be65;">"onPinch()"</span> /&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> PinchGestureEventData <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/ui/gestures"</span>;

<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">onPinch</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span>: <span style="color: #db5762;">PinchGestureEventData</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">args is of type PinchGestureEventData</span>
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`scale: ${args.scale}`</span><span style="color: #c678dd;">)</span>;
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`tate: ${args.state}`</span><span style="color: #c678dd;">)</span>;
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`getFocusX(): ${args.getFocusX()}`</span><span style="color: #c678dd;">)</span>;
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`getFocusY(): ${args.getFocusY()}`</span><span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>Rotation</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">Label</span> <span style="color: #db5762;">text</span>=<span style="color: #98be65;">"Rotate me!"</span> <span style="color: #db5762;">rotation</span>=<span style="color: #98be65;">"onRotation()"</span>/&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> RotationGestureEventData <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/ui/gestures"</span>;

<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">onRotation</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span>: <span style="color: #db5762;">RotationGestureEventData</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">args is of type RotationGestureEventData</span>
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`${args.eventName} event triggered for ${args.view}`</span><span style="color: #c678dd;">)</span>;
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`rotation:  ${args.rotation}`</span><span style="color: #c678dd;">)</span>;
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`state:  ${args.state}`</span><span style="color: #c678dd;">)</span>;
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>Swipe</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">Label</span> <span style="color: #db5762;">text</span>=<span style="color: #98be65;">"Swipe me!"</span> <span style="color: #db5762;">swipe</span>=<span style="color: #98be65;">"onSwipe()"</span>/&gt;
</pre>
</div>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> SwipeDirection, SwipeGestureEventData <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/ui/gestures"</span>;

<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">function</span> <span style="color: #c678dd;">onSwipe</span><span style="color: #fff0f5;">(</span><span style="color: #db5762;">args</span>: <span style="color: #db5762;">SwipeGestureEventData</span><span style="color: #fff0f5;">)</span> <span style="color: #fff0f5;">{</span>
    alert<span style="color: #c678dd;">(</span><span style="color: #98be65;">`${args.eventName} event triggered for ${args.view}`</span><span style="color: #c678dd;">)</span>;
    <span style="color: #51afef; font-style: italic;">let</span> <span style="color: #db5762;">direction</span>: SwipeDirection = args.direction;
    console.log<span style="color: #c678dd;">(</span><span style="color: #98be65;">`direction ${direction}`</span><span style="color: #c678dd;">)</span>; <span style="color: #5B6268;">// </span><span style="color: #5B6268;">SwipeDirection enumeration: up, down, left, right</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5eea481" class="outline-2">
<h2 id="org5eea481"><span class="section-number-2">9</span> User Interface Modules</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org864d006" class="outline-3">
<h3 id="org864d006"><span class="section-number-3">9.1</span> <a href="https://docs.nativescript.org/ui/ns-ui-widgets/frame">Frame</a></h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li>Generally not needed when working with Angular</li>
</ul>
</div>
</div>
<div id="outline-container-org54fa1e4" class="outline-3">
<h3 id="org54fa1e4"><span class="section-number-3">9.2</span> <a href="https://docs.nativescript.org/ui/ns-ui-widgets/page">Page</a></h3>
<div class="outline-text-3" id="text-9-2">
<ul class="org-ul">
<li>Generally not needed when working with Angular, unless for binding the context</li>
</ul>
</div>
</div>
