notes/resources/nativescript/nativescript.org
** [[https://docs.nativescript.org/ns-framework-modules/color][Color]]
   - Easily create colors
   #+begin_src typescript
     // Creates the red color
     const color = new Color("#FF0000");

     // Creates the color #FF8800
     const color = new Color("#F80");

     // Creates the color with 100 alpha, 255 red, 100 green, 100 blue
     const color = new Color(100, 255, 100, 100);
   #+end_src
** [[https://docs.nativescript.org/ns-framework-modules/xml-parser][XML Parsing]]
