notes/resources/nativescript/nativescript.html
<div id="outline-container-org74b5cfd" class="outline-3">
<h3 id="org74b5cfd"><span class="section-number-3">9.3</span> <a href="https://docs.nativescript.org/ns-framework-modules/color">Color</a></h3>
<div class="outline-text-3" id="text-9-3">
<ul class="org-ul">
<li>Easily create colors</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">Creates the red color</span>
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">color</span> = <span style="color: #51afef; font-style: italic;">new</span> <span style="color: #ECBE7B;">Color</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"#FF0000"</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Creates the color #FF8800</span>
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">color</span> = <span style="color: #51afef; font-style: italic;">new</span> <span style="color: #ECBE7B;">Color</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"#F80"</span><span style="color: #fff0f5;">)</span>;

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Creates the color with 100 alpha, 255 red, 100 green, 100 blue</span>
<span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">color</span> = <span style="color: #51afef; font-style: italic;">new</span> <span style="color: #ECBE7B;">Color</span><span style="color: #fff0f5;">(</span>100, 255, 100, 100<span style="color: #fff0f5;">)</span>;
</pre>
</div>
</div>
</div>
