notes/resources/nativescript/nativescript.org
* Styling
  - Measurement units
    - *DIPs* (recommended): ~font-size: 20~
    - *pixels*: ~font-size 20px~
    - *percentages*: ~height: 20%~
  - Allowed CSS properties
    | CSS Property        | JS Property         | Description                                                                                                            |
    |---------------------+---------------------+------------------------------------------------------------------------------------------------------------------------|
    | color               | color               | Sets a solid-color value to the matched view’s foreground.                                                             |
    | background          | background          | Sets a solid-color value or a linear gradient to the matched view’s background.                                        |
    | background-color    | backgroundColor     | Sets a solid-color value to the matched view’s background.                                                             |
    | placeholder-color   | placeholderColor    | Sets the placeholder (hint) font color to matched views.                                                               |
    | background-image    | backgroundImage     | Sets a image url to the matched view’s background image.                                                               |
    | background-repeat   | backgroundRepeat    | Sets if/how the background image should be repeated. Possible values: repeat, repeat-x, repeat-y, no-repeat            |
    | background-position | backgroundPosition  | Sets the starting position of the background image.                                                                    |
    | background-size     | backgroundSize      | Sets the size of the background image. Possible values: "length length", "percent% percent%", "cover" or "contain".    |
    | border-color        | borderColor         | Sets border colors to the matched view’s.                                                                              |
    | border-top-color    | borderTopColor      | Sets a top border color to the matched view’s.                                                                         |
    | border-right-color  | borderRightColor    | Sets a right border color to the matched view’s.                                                                       |
    | border-bottom-color | borderBottomColor   | Sets a bottom border color to the matched view’s.                                                                      |
    | border-left-color   | borderLeftColor     | Sets a left border color to the matched view’s.                                                                        |
    | border-width        | borderWidth         | Sets border widths to the matched view’s.                                                                              |
    | border-top-width    | borderTopWidth      | Sets a top border width to the matched view’s.                                                                         |
    | border-right-width  | borderRightWidth    | Sets a right border width to the matched view’s.                                                                       |
    | border-bottom-width | borderBottomWidth   | Sets a bottom border width to the matched view’s.                                                                      |
    | border-left-width   | borderLeftWidth     | Sets a left border width to the matched view’s.                                                                        |
    | border-radius       | borderRadius        | Sets a border radius to the matched view’s.                                                                            |
    | font                | font                | Sets the font properties (this includes font-family, font-size, font-style and font-weight) of the matched view.       |
    | font-family         | fontFamily          | Sets the font family of the matched view.                                                                              |
    | font-size           | fontSize            | Sets the font size of the matched view (only supports device-independent units).                                       |
    | font-style          | fontStyle           | Sets the font style of the matched view. Possible values: italic, normal.                                              |
    | font-weight         | fontWeight          | Sets the font weight of the matched view                                                                               |
    | text-align          | textAlignment       | Sets text alignment in the matched view. Possible values: left , center, right.                                        |
    | text-decoration     | textDecoration      | Sets the text formatting. Possible values: none, line-through, underline.                                              |
    | text-transform      | textTransform       | Sets the text transform. Possible values: none, capitalize, uppercase, lowercase.                                      |
    | letter-spacing      | letterSpacing       | Sets the text letter spacing. (On Android API Level 21 and above.)                                                     |
    | line-height         | lineHeight          | Sets the text line height                                                                                              |
    | z-index             | zIndex              | Sets the z-index. (On Android API Level 21 and above.)                                                                 |
    | clip-path           | clip-path           | Sets the clip-path. Supported shapes are circle, ellipse, rect and polygon. You can define your own shape using clippy |
    | vertical-align      | verticalAlignment   | Sets the vertical alignment of the current view within its parent. Possible values: top, center, bottom, stretch.      |
    | horizontal-align    | horizontalAlignment | Sets the horizontal alignment of the current view within its parent. Possible values: left, center, right, stretch.    |
    | margin              | margin              | Sets the margin of the view within its parent.                                                                         |
    | margin-top          | marginTop           | Sets the top margin of the view within its parent.                                                                     |
    | margin-right        | marginRight         | Sets the right margin of the view within its parent.                                                                   |
    | margin-bottom       | marginBottom        | Sets the bottom margin of the view within its parent.                                                                  |
    | margin-left         | marginLeft          | Sets the left margin of the view within its parent.                                                                    |
    | width               | width               | Sets the view width.                                                                                                   |
    | height              | height              | Sets the view height.                                                                                                  |
    | min-width           | minWidth            | Sets the minimal view width.                                                                                           |
    | min-height          | minHeight           | Sets the minimal view height.                                                                                          |
    | padding             | padding             | Sets the distance between the boundaries of the layout container and its children.                                     |
    | padding-top         | paddingTop          | Sets the top padding of a layout container.                                                                            |
    | padding-right       | paddingRight        | Sets the right padding of a layout container.                                                                          |
    | padding-bottom      | paddingBottom       | Sets the bottom padding of a layout container.                                                                         |
    | padding-left        | paddingLeft         | Sets the left padding of a layout container.                                                                           |
    | visibility          | visibility          | Sets the view visibility. Possible values: visible, collapse (or collapsed).                                           |
    | opacity             | opacity             | Sets the view opacity. The value is in the [0, 1] range.                                                               |
  - Nativescript specific CSS properties
    | CSS Property                         | JS Property                      | Platform | Compatibility | Description                                                                                                            |
    |--------------------------------------+----------------------------------+----------+---------------+------------------------------------------------------------------------------------------------------------------------|
    | selected-tab-text-color              | selectedTabTextColor             | Both     | TabView       | Sets the color of the text, while selecting some of the tabs.                                                          |
    | tab-background-color                 | tabBackgroundColor               | Both     | TabView       | Sets the background color of the tabs.                                                                                 |
    | tab-text-font-size                   | tabTextFontSize                  | Both     | TabView       | Sets the tab titles font size, without changing the font size of all contents of the tab.                              |
    | text-transform                       | textTransform                    | Both     | TabViewItem   | Sets the text transform individually for every TabViewItem. Value options: capitalize, lowercase, none, and uppercase. |
    | android-selected-tab-highlight-color | androidSelectedTabHighlightColor | Android  | TabView       | Sets the underline color of the tabs in Android.                                                                       |
