notes/resources/nativescript/nativescript.html
<div id="outline-container-org69f9243" class="outline-3">
<h3 id="org69f9243"><span class="section-number-3">9.4</span> <a href="https://docs.nativescript.org/ns-framework-modules/xml-parser">XML Parsing</a></h3>
</div>
</div>
<div id="outline-container-org9f67350" class="outline-2">
<h2 id="org9f67350"><span class="section-number-2">10</span> Styling</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Measurement units
<ul class="org-ul">
<li><b>DIPs</b> (recommended): <code>font-size: 20</code></li>
<li><b>pixels</b>: <code>font-size 20px</code></li>
<li><b>percentages</b>: <code>height: 20%</code></li>
</ul></li>
<li><p>
Allowed CSS properties
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">CSS Property</th>
<th scope="col" class="org-left">JS Property</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">color</td>
<td class="org-left">color</td>
<td class="org-left">Sets a solid-color value to the matched views foreground.</td>
</tr>

<tr>
<td class="org-left">background</td>
<td class="org-left">background</td>
<td class="org-left">Sets a solid-color value or a linear gradient to the matched views background.</td>
</tr>

<tr>
<td class="org-left">background-color</td>
<td class="org-left">backgroundColor</td>
<td class="org-left">Sets a solid-color value to the matched views background.</td>
</tr>

<tr>
<td class="org-left">placeholder-color</td>
<td class="org-left">placeholderColor</td>
<td class="org-left">Sets the placeholder (hint) font color to matched views.</td>
</tr>

<tr>
<td class="org-left">background-image</td>
<td class="org-left">backgroundImage</td>
<td class="org-left">Sets a image url to the matched views background image.</td>
</tr>

<tr>
<td class="org-left">background-repeat</td>
<td class="org-left">backgroundRepeat</td>
<td class="org-left">Sets if/how the background image should be repeated. Possible values: repeat, repeat-x, repeat-y, no-repeat</td>
</tr>

<tr>
<td class="org-left">background-position</td>
<td class="org-left">backgroundPosition</td>
<td class="org-left">Sets the starting position of the background image.</td>
</tr>

<tr>
<td class="org-left">background-size</td>
<td class="org-left">backgroundSize</td>
<td class="org-left">Sets the size of the background image. Possible values: "length length", "percent% percent%", "cover" or "contain".</td>
</tr>

<tr>
<td class="org-left">border-color</td>
<td class="org-left">borderColor</td>
<td class="org-left">Sets border colors to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-top-color</td>
<td class="org-left">borderTopColor</td>
<td class="org-left">Sets a top border color to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-right-color</td>
<td class="org-left">borderRightColor</td>
<td class="org-left">Sets a right border color to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-bottom-color</td>
<td class="org-left">borderBottomColor</td>
<td class="org-left">Sets a bottom border color to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-left-color</td>
<td class="org-left">borderLeftColor</td>
<td class="org-left">Sets a left border color to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-width</td>
<td class="org-left">borderWidth</td>
<td class="org-left">Sets border widths to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-top-width</td>
<td class="org-left">borderTopWidth</td>
<td class="org-left">Sets a top border width to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-right-width</td>
<td class="org-left">borderRightWidth</td>
<td class="org-left">Sets a right border width to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-bottom-width</td>
<td class="org-left">borderBottomWidth</td>
<td class="org-left">Sets a bottom border width to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-left-width</td>
<td class="org-left">borderLeftWidth</td>
<td class="org-left">Sets a left border width to the matched views.</td>
</tr>

<tr>
<td class="org-left">border-radius</td>
<td class="org-left">borderRadius</td>
<td class="org-left">Sets a border radius to the matched views.</td>
</tr>

<tr>
<td class="org-left">font</td>
<td class="org-left">font</td>
<td class="org-left">Sets the font properties (this includes font-family, font-size, font-style and font-weight) of the matched view.</td>
</tr>

<tr>
<td class="org-left">font-family</td>
<td class="org-left">fontFamily</td>
<td class="org-left">Sets the font family of the matched view.</td>
</tr>

<tr>
<td class="org-left">font-size</td>
<td class="org-left">fontSize</td>
<td class="org-left">Sets the font size of the matched view (only supports device-independent units).</td>
</tr>

<tr>
<td class="org-left">font-style</td>
<td class="org-left">fontStyle</td>
<td class="org-left">Sets the font style of the matched view. Possible values: italic, normal.</td>
</tr>

<tr>
<td class="org-left">font-weight</td>
<td class="org-left">fontWeight</td>
<td class="org-left">Sets the font weight of the matched view</td>
</tr>

<tr>
<td class="org-left">text-align</td>
<td class="org-left">textAlignment</td>
<td class="org-left">Sets text alignment in the matched view. Possible values: left , center, right.</td>
</tr>

<tr>
<td class="org-left">text-decoration</td>
<td class="org-left">textDecoration</td>
<td class="org-left">Sets the text formatting. Possible values: none, line-through, underline.</td>
</tr>

<tr>
<td class="org-left">text-transform</td>
<td class="org-left">textTransform</td>
<td class="org-left">Sets the text transform. Possible values: none, capitalize, uppercase, lowercase.</td>
</tr>

<tr>
<td class="org-left">letter-spacing</td>
<td class="org-left">letterSpacing</td>
<td class="org-left">Sets the text letter spacing. (On Android API Level 21 and above.)</td>
</tr>

<tr>
<td class="org-left">line-height</td>
<td class="org-left">lineHeight</td>
<td class="org-left">Sets the text line height</td>
</tr>

<tr>
<td class="org-left">z-index</td>
<td class="org-left">zIndex</td>
<td class="org-left">Sets the z-index. (On Android API Level 21 and above.)</td>
</tr>

<tr>
<td class="org-left">clip-path</td>
<td class="org-left">clip-path</td>
<td class="org-left">Sets the clip-path. Supported shapes are circle, ellipse, rect and polygon. You can define your own shape using clippy</td>
</tr>

<tr>
<td class="org-left">vertical-align</td>
<td class="org-left">verticalAlignment</td>
<td class="org-left">Sets the vertical alignment of the current view within its parent. Possible values: top, center, bottom, stretch.</td>
</tr>

<tr>
<td class="org-left">horizontal-align</td>
<td class="org-left">horizontalAlignment</td>
<td class="org-left">Sets the horizontal alignment of the current view within its parent. Possible values: left, center, right, stretch.</td>
</tr>

<tr>
<td class="org-left">margin</td>
<td class="org-left">margin</td>
<td class="org-left">Sets the margin of the view within its parent.</td>
</tr>

<tr>
<td class="org-left">margin-top</td>
<td class="org-left">marginTop</td>
<td class="org-left">Sets the top margin of the view within its parent.</td>
</tr>

<tr>
<td class="org-left">margin-right</td>
<td class="org-left">marginRight</td>
<td class="org-left">Sets the right margin of the view within its parent.</td>
</tr>

<tr>
<td class="org-left">margin-bottom</td>
<td class="org-left">marginBottom</td>
<td class="org-left">Sets the bottom margin of the view within its parent.</td>
</tr>

<tr>
<td class="org-left">margin-left</td>
<td class="org-left">marginLeft</td>
<td class="org-left">Sets the left margin of the view within its parent.</td>
</tr>

<tr>
<td class="org-left">width</td>
<td class="org-left">width</td>
<td class="org-left">Sets the view width.</td>
</tr>

<tr>
<td class="org-left">height</td>
<td class="org-left">height</td>
<td class="org-left">Sets the view height.</td>
</tr>

<tr>
<td class="org-left">min-width</td>
<td class="org-left">minWidth</td>
<td class="org-left">Sets the minimal view width.</td>
</tr>

<tr>
<td class="org-left">min-height</td>
<td class="org-left">minHeight</td>
<td class="org-left">Sets the minimal view height.</td>
</tr>

<tr>
<td class="org-left">padding</td>
<td class="org-left">padding</td>
<td class="org-left">Sets the distance between the boundaries of the layout container and its children.</td>
</tr>

<tr>
<td class="org-left">padding-top</td>
<td class="org-left">paddingTop</td>
<td class="org-left">Sets the top padding of a layout container.</td>
</tr>

<tr>
<td class="org-left">padding-right</td>
<td class="org-left">paddingRight</td>
<td class="org-left">Sets the right padding of a layout container.</td>
</tr>

<tr>
<td class="org-left">padding-bottom</td>
<td class="org-left">paddingBottom</td>
<td class="org-left">Sets the bottom padding of a layout container.</td>
</tr>

<tr>
<td class="org-left">padding-left</td>
<td class="org-left">paddingLeft</td>
<td class="org-left">Sets the left padding of a layout container.</td>
</tr>

<tr>
<td class="org-left">visibility</td>
<td class="org-left">visibility</td>
<td class="org-left">Sets the view visibility. Possible values: visible, collapse (or collapsed).</td>
</tr>

<tr>
<td class="org-left">opacity</td>
<td class="org-left">opacity</td>
<td class="org-left">Sets the view opacity. The value is in the [0, 1] range.</td>
</tr>
</tbody>
</table></li>
<li><p>
Nativescript specific CSS properties
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">CSS Property</th>
<th scope="col" class="org-left">JS Property</th>
<th scope="col" class="org-left">Platform</th>
<th scope="col" class="org-left">Compatibility</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">selected-tab-text-color</td>
<td class="org-left">selectedTabTextColor</td>
<td class="org-left">Both</td>
<td class="org-left">TabView</td>
<td class="org-left">Sets the color of the text, while selecting some of the tabs.</td>
</tr>

<tr>
<td class="org-left">tab-background-color</td>
<td class="org-left">tabBackgroundColor</td>
<td class="org-left">Both</td>
<td class="org-left">TabView</td>
<td class="org-left">Sets the background color of the tabs.</td>
</tr>

<tr>
<td class="org-left">tab-text-font-size</td>
<td class="org-left">tabTextFontSize</td>
<td class="org-left">Both</td>
<td class="org-left">TabView</td>
<td class="org-left">Sets the tab titles font size, without changing the font size of all contents of the tab.</td>
</tr>

<tr>
<td class="org-left">text-transform</td>
<td class="org-left">textTransform</td>
<td class="org-left">Both</td>
<td class="org-left">TabViewItem</td>
<td class="org-left">Sets the text transform individually for everyTabViewItem. Value options: capitalize, lowercase, none, and uppercase.</td>
</tr>

<tr>
<td class="org-left">android-selected-tab-highlight-color</td>
<td class="org-left">androidSelectedTabHighlightColor</td>
<td class="org-left">Android</td>
<td class="org-left">TabView</td>
<td class="org-left">Sets the underline color of the tabs in Android.</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
