notes/resources/nativescript/nativescript.org
* Themes
  - [[https://docs.nativescript.org/ui/theme][Built-in themes]]
  - [[https://docs.nativescript.org/ui/theme#class-names][Class names for widgets]]
* [[https://docs.nativescript.org/angular/core-concepts/utils][Utils]]
  - Import
  #+begin_src typescript
    import * as utils from "tns-core-modules/utils/utils";
  #+end_src
  - Methods:
    - ~isFileOrResourcePath()~
    - ~isDataURI()~
    - ~openUrl()~
    - ~escapeRegexSymbols()~
    - ~convertString()~
    - ~getDisplayDensity()~
    - ~toDevicePixels()~
    - ~toDeviceIndependentPixels()~
    - ~round()~
  - Android only methods:
    - ~getApplication()~
    - ~getApplicationContext()~
    - ~getInputMethodManager()~
    - ~showSoftInput()~
    - ~dismissSoftInput()~
    - ~stringArrayToStringSet()~
    - ~stringSetToStringArray()~
    - ~getDrawableId()~
    - ~getStringId()~
    - ~getId()~
    - ~getPalleteColor()~
  - iOS only methods:
    - ~jsArrayToNSArray()~
    - ~nsArrayToJSArray()~
    - ~isLandscape()~
    - ~MajorVersion()~
    - ~openFile()~
* [[https://docs.nativescript.org/angular/ui/layouts/layout-containers][Layouts]]
** Stack Layout
** Grid Layout
** Absolute Layout
** Wrap Layout
** Dock Layout
* Widgets
** ActionBar
** ActivityIndicator
** Animations
** Button
** DatePicker
** Dialogs
** FormattedString
** Gestures
** HtmlView
** Image
** Label
** Layouts
** ListPicker
** ListView
** Progress
** ScrollView
** SearchBar
** SegmentedBar
** Slider
** Styling
** Switch
** TabView
** TextField
** TextView
** TimePicker
** WebView
** NG Directives
** Icon Fonts
* Navigation
** Introduction
   - Navigation is much the same as the standard Angular. A ~page-router-outlet~ is used in Nativescript to output the individual pages instead of ~router-outlet~
   - A ~nsRouterLink~ is used instead of ~routerLink~ for navigating between pages. Please note the additional ~clearHistory~ and ~pageTransition~ parameters
   #+begin_src xml
    <Button text="Button" [nsRouterLink]="['/main']" pageTransition="slide" clearHistory="true"></Button>
   #+end_src
** Configuration
   - Is basically the same as it is in Angular apart from the Router module import
   - Declare routes
   #+begin_src typescript
     export const routes = [
         { path: "login", component: LoginComponent },
         { path: "groceries", component: GroceryListComponent },
         { path: "grocery/:id", component: GroceryComponent }
     ];
   #+end_src
   - Use the ~NativeScriptRouterModule~ to import the routes
   #+begin_src typescript
     import { NativeScriptRouterModule } from "nativescript-angular/router";

     @NgModule({
         bootstrap: [GroceriesApp],
         imports: [
             NativeScriptRouterModule,
             NativeScriptRouterModule.forRoot(routes)
         ]
     })
     export class GroceriesAppModule { }
   #+end_src

