notes/resources/nativescript/nativescript.html
<div id="outline-container-org9cf471a" class="outline-2">
<h2 id="org9cf471a"><span class="section-number-2">11</span> Themes</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li><a href="https://docs.nativescript.org/ui/theme">Built-in themes</a></li>
<li><a href="https://docs.nativescript.org/ui/theme#class-names">Class names for widgets</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge8cb941" class="outline-2">
<h2 id="orge8cb941"><span class="section-number-2">12</span> <a href="https://docs.nativescript.org/angular/core-concepts/utils">Utils</a></h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>Import</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> * <span style="color: #51afef; font-style: italic;">as</span> utils <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"tns-core-modules/utils/utils"</span>;
</pre>
</div>
<ul class="org-ul">
<li>Methods:
<ul class="org-ul">
<li><code>isFileOrResourcePath()</code></li>
<li><code>isDataURI()</code></li>
<li><code>openUrl()</code></li>
<li><code>escapeRegexSymbols()</code></li>
<li><code>convertString()</code></li>
<li><code>getDisplayDensity()</code></li>
<li><code>toDevicePixels()</code></li>
<li><code>toDeviceIndependentPixels()</code></li>
<li><code>round()</code></li>
</ul></li>
<li>Android only methods:
<ul class="org-ul">
<li><code>getApplication()</code></li>
<li><code>getApplicationContext()</code></li>
<li><code>getInputMethodManager()</code></li>
<li><code>showSoftInput()</code></li>
<li><code>dismissSoftInput()</code></li>
<li><code>stringArrayToStringSet()</code></li>
<li><code>stringSetToStringArray()</code></li>
<li><code>getDrawableId()</code></li>
<li><code>getStringId()</code></li>
<li><code>getId()</code></li>
<li><code>getPalleteColor()</code></li>
</ul></li>
<li>iOS only methods:
<ul class="org-ul">
<li><code>jsArrayToNSArray()</code></li>
<li><code>nsArrayToJSArray()</code></li>
<li><code>isLandscape()</code></li>
<li><code>MajorVersion()</code></li>
<li><code>openFile()</code></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3cc1c65" class="outline-2">
<h2 id="org3cc1c65"><span class="section-number-2">13</span> <a href="https://docs.nativescript.org/angular/ui/layouts/layout-containers">Layouts</a></h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org16dc667" class="outline-3">
<h3 id="org16dc667"><span class="section-number-3">13.1</span> Stack Layout</h3>
</div>
<div id="outline-container-orgf8aff79" class="outline-3">
<h3 id="orgf8aff79"><span class="section-number-3">13.2</span> Grid Layout</h3>
</div>
<div id="outline-container-org3796bfa" class="outline-3">
<h3 id="org3796bfa"><span class="section-number-3">13.3</span> Absolute Layout</h3>
</div>
<div id="outline-container-org949e0da" class="outline-3">
<h3 id="org949e0da"><span class="section-number-3">13.4</span> Wrap Layout</h3>
</div>
<div id="outline-container-orgffca3d7" class="outline-3">
<h3 id="orgffca3d7"><span class="section-number-3">13.5</span> Dock Layout</h3>
</div>
</div>
<div id="outline-container-orgef20a6a" class="outline-2">
<h2 id="orgef20a6a"><span class="section-number-2">14</span> Widgets</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org85c95a0" class="outline-3">
<h3 id="org85c95a0"><span class="section-number-3">14.1</span> ActionBar</h3>
</div>
<div id="outline-container-orgb9b54f7" class="outline-3">
<h3 id="orgb9b54f7"><span class="section-number-3">14.2</span> ActivityIndicator</h3>
</div>
<div id="outline-container-orgbb1711e" class="outline-3">
<h3 id="orgbb1711e"><span class="section-number-3">14.3</span> Animations</h3>
</div>
<div id="outline-container-org5142c4e" class="outline-3">
<h3 id="org5142c4e"><span class="section-number-3">14.4</span> Button</h3>
</div>
<div id="outline-container-org143d310" class="outline-3">
<h3 id="org143d310"><span class="section-number-3">14.5</span> DatePicker</h3>
</div>
<div id="outline-container-org8b4076c" class="outline-3">
<h3 id="org8b4076c"><span class="section-number-3">14.6</span> Dialogs</h3>
</div>
<div id="outline-container-org9b7b357" class="outline-3">
<h3 id="org9b7b357"><span class="section-number-3">14.7</span> FormattedString</h3>
</div>
<div id="outline-container-orgd620c17" class="outline-3">
<h3 id="orgd620c17"><span class="section-number-3">14.8</span> Gestures</h3>
</div>
<div id="outline-container-org2d248ff" class="outline-3">
<h3 id="org2d248ff"><span class="section-number-3">14.9</span> HtmlView</h3>
</div>
<div id="outline-container-orgf1c56f2" class="outline-3">
<h3 id="orgf1c56f2"><span class="section-number-3">14.10</span> Image</h3>
</div>
<div id="outline-container-org1090af2" class="outline-3">
<h3 id="org1090af2"><span class="section-number-3">14.11</span> Label</h3>
</div>
<div id="outline-container-org50f7623" class="outline-3">
<h3 id="org50f7623"><span class="section-number-3">14.12</span> Layouts</h3>
</div>
<div id="outline-container-orge014e03" class="outline-3">
<h3 id="orge014e03"><span class="section-number-3">14.13</span> ListPicker</h3>
</div>
<div id="outline-container-org1626336" class="outline-3">
<h3 id="org1626336"><span class="section-number-3">14.14</span> ListView</h3>
</div>
<div id="outline-container-org1c8a30a" class="outline-3">
<h3 id="org1c8a30a"><span class="section-number-3">14.15</span> Progress</h3>
</div>
<div id="outline-container-orgb60d806" class="outline-3">
<h3 id="orgb60d806"><span class="section-number-3">14.16</span> ScrollView</h3>
</div>
<div id="outline-container-org5b2df3b" class="outline-3">
<h3 id="org5b2df3b"><span class="section-number-3">14.17</span> SearchBar</h3>
</div>
<div id="outline-container-orgb173cb9" class="outline-3">
<h3 id="orgb173cb9"><span class="section-number-3">14.18</span> SegmentedBar</h3>
</div>
<div id="outline-container-org84ae98f" class="outline-3">
<h3 id="org84ae98f"><span class="section-number-3">14.19</span> Slider</h3>
</div>
<div id="outline-container-org90a1149" class="outline-3">
<h3 id="org90a1149"><span class="section-number-3">14.20</span> Styling</h3>
</div>
<div id="outline-container-org606073e" class="outline-3">
<h3 id="org606073e"><span class="section-number-3">14.21</span> Switch</h3>
</div>
<div id="outline-container-orge872ade" class="outline-3">
<h3 id="orge872ade"><span class="section-number-3">14.22</span> TabView</h3>
</div>
<div id="outline-container-org0f5bc7d" class="outline-3">
<h3 id="org0f5bc7d"><span class="section-number-3">14.23</span> TextField</h3>
</div>
<div id="outline-container-orgbe454c9" class="outline-3">
<h3 id="orgbe454c9"><span class="section-number-3">14.24</span> TextView</h3>
</div>
<div id="outline-container-org32fbb66" class="outline-3">
<h3 id="org32fbb66"><span class="section-number-3">14.25</span> TimePicker</h3>
</div>
<div id="outline-container-orgad900f3" class="outline-3">
<h3 id="orgad900f3"><span class="section-number-3">14.26</span> WebView</h3>
</div>
<div id="outline-container-orgc0ec6eb" class="outline-3">
<h3 id="orgc0ec6eb"><span class="section-number-3">14.27</span> NG Directives</h3>
</div>
<div id="outline-container-org41b1c71" class="outline-3">
<h3 id="org41b1c71"><span class="section-number-3">14.28</span> Icon Fonts</h3>
</div>
</div>
<div id="outline-container-org8270ccb" class="outline-2">
<h2 id="org8270ccb"><span class="section-number-2">15</span> Navigation</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org2f3f64b" class="outline-3">
<h3 id="org2f3f64b"><span class="section-number-3">15.1</span> Introduction</h3>
<div class="outline-text-3" id="text-15-1">
<ul class="org-ul">
<li>Navigation is much the same as the standard Angular. A <code>page-router-outlet</code> is used in Nativescript to output the individual pages instead of <code>router-outlet</code></li>
<li>A <code>nsRouterLink</code> is used instead of <code>routerLink</code> for navigating between pages. Please note the additional <code>clearHistory</code> and <code>pageTransition</code> parameters</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #c678dd;">Button</span> <span style="color: #db5762;">text</span>=<span style="color: #98be65;">"Button"</span> [nsRouterLink]=<span style="color: #98be65;">"['/main']"</span> <span style="color: #db5762;">pageTransition</span>=<span style="color: #98be65;">"slide"</span> <span style="color: #db5762;">clearHistory</span>=<span style="color: #98be65;">"true"</span>&gt;&lt;/<span style="color: #c678dd;">Button</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgddfb345" class="outline-3">
<h3 id="orgddfb345"><span class="section-number-3">15.2</span> Configuration</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li>Is basically the same as it is in Angular apart from the Router module import</li>
<li>Declare routes</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">const</span> <span style="color: #db5762;">routes</span> = <span style="color: #fff0f5;">[</span>
    <span style="color: #c678dd;">{</span> path: <span style="color: #98be65;">"login"</span>, component: LoginComponent <span style="color: #c678dd;">}</span>,
    <span style="color: #c678dd;">{</span> path: <span style="color: #98be65;">"groceries"</span>, component: GroceryListComponent <span style="color: #c678dd;">}</span>,
    <span style="color: #c678dd;">{</span> path: <span style="color: #98be65;">"grocery/:id"</span>, component: GroceryComponent <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">]</span>;
</pre>
</div>
<ul class="org-ul">
<li>Use the <code>NativeScriptRouterModule</code> to import the routes</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> NativeScriptRouterModule <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"nativescript-angular/router"</span>;

@NgModule<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">{</span>
    bootstrap: <span style="color: #98be65;">[</span>GroceriesApp<span style="color: #98be65;">]</span>,
    imports: <span style="color: #98be65;">[</span>
        NativeScriptRouterModule,
        NativeScriptRouterModule.forRoot<span style="color: #00bfff;">(</span>routes<span style="color: #00bfff;">)</span>
    <span style="color: #98be65;">]</span>
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">class</span> <span style="color: #ECBE7B;">GroceriesAppModule</span> <span style="color: #fff0f5;">{</span> <span style="color: #fff0f5;">}</span>
</pre>
</div>
</div>
</div>
