notes/resources/nativescript/nativescript.org
** ~RouterExtensions~
   - ~RouterExtensions~ class is used instead of the ~Router~ class for imperative navigation
   #+begin_src typescript
    import { RouterExtensions } from "nativescript-angular/router";

    @Component({
        // ...
    })
    export class MainComponent {

        constructor(private routerExtensions: RouterExtensions) {
        }
    }
   #+end_src
   - Available ~RouterExtensions~ methods:
     - ~navigate()~
     - ~navigateByUrl()~
     - ~back()~
     - ~canGoBack()~
     - ~backToPreviousPage()~
     - ~canGoBackToPreviousPage()~
* [[https://docs.nativescript.org/angular/core-concepts/multithreading-model][Multithreading with workers]]
* Delete Heading once notes are completed, leave exports behind
  #+BEGIN_EXPORT html
  <script src="../../assets/jquery-3.3.1.min.js"></script>
  <script src="../../assets/notes.js"></script>
  #+END_EXPORT
