notes/resources/nativescript/nativescript.html

<div id="outline-container-orgdb4bd23" class="outline-3">
<h3 id="orgdb4bd23"><span class="section-number-3">15.3</span> <code>RouterExtensions</code></h3>
<div class="outline-text-3" id="text-15-3">
<ul class="org-ul">
<li><code>RouterExtensions</code> class is used instead of the <code>Router</code> class for imperative navigation</li>
</ul>
<div class="org-src-container">
<pre class="src src-typescript"><span style="color: #51afef; font-style: italic;">import</span> <span style="color: #fff0f5;">{</span> RouterExtensions <span style="color: #fff0f5;">}</span> <span style="color: #51afef; font-style: italic;">from</span> <span style="color: #98be65;">"nativescript-angular/router"</span>;

@Component<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">{</span>
    <span style="color: #5B6268;">// </span><span style="color: #5B6268;">...</span>
<span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">export</span> <span style="color: #51afef; font-style: italic;">class</span> <span style="color: #ECBE7B;">MainComponent</span> <span style="color: #fff0f5;">{</span>

    <span style="color: #51afef; font-style: italic;">constructor</span><span style="color: #c678dd;">(</span><span style="color: #51afef; font-style: italic;">private</span> routerExtensions: RouterExtensions<span style="color: #c678dd;">)</span> <span style="color: #c678dd;">{</span>
    <span style="color: #c678dd;">}</span>
<span style="color: #fff0f5;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>Available <code>RouterExtensions</code> methods:
<ul class="org-ul">
<li><code>navigate()</code></li>
<li><code>navigateByUrl()</code></li>
<li><code>back()</code></li>
<li><code>canGoBack()</code></li>
<li><code>backToPreviousPage()</code></li>
<li><code>canGoBackToPreviousPage()</code></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3ce1bb6" class="outline-2">
<h2 id="org3ce1bb6"><span class="section-number-2">16</span> <a href="https://docs.nativescript.org/angular/core-concepts/multithreading-model">Multithreading with workers</a></h2>
</div>
<div id="outline-container-org0705b28" class="outline-2">
<h2 id="org0705b28"><span class="section-number-2">17</span> Delete Heading once notes are completed, leave exports behind</h2>
<div class="outline-text-2" id="text-17">
<script src="../../assets/jquery-3.3.1.min.js"></script>
<script src="../../assets/notes.js"></script>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-03-10 Sun 10:31</p>
<p class="author">Author: Damian Chrzanowski</p>
<p class="date">Created: 2019-03-10 Sun 20:01</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
